var correctAnswer = "";
var attempt = 0;
var correctLetter = 0;
var endgame = false;
var answers = ["あーけーど","あーちすと","あーもんど","あいえんか","あいきゅー","あいきょう","あいことば","あいしゅう","あいしょう","あいしょう","あいじょう","あいだがら","あいちゃく","あいでぃあ","あいてぃー","あいてかた","あいてやく","あうとどあ","あかちゃん","あからさま","あがりこむ","あかんぼう","あきまつり","あきらめる","あくしゅう","あくしょん","あくせんと","あくてぃぶ","あくりょく","あげあぶら","あげおろし","あけくれる","あこがれる","あさごはん","あさねぼう","あしがかり","あじきない","あたいする","あたたかい","あたたかい","あたたかみ","あたたまる","あたためる","あだぷたー","あたまから","あたまきん","あたらしい","あたりまえ","あっけない","あっしゅく","あっしょう","あっぷりけ","あつりょく","あてはまる","あとしまつ","あどばいす","あとまわし","あなうんさ","あなうんす","あねったい","あぶらあげ","あぷろーち","あまからい","あまちゅあ","あまやかす","あまりもの","あまんずる","あみのさん","あめりかん","あゆみよる","あらいもの","あらかじめ","あらたまる","あらためて","あらためる","あらっぽい","あらわれる","ありがたい","ありがとう","ありきたり","ありふれる","あるこーる","あるばいと","あるみはく","あれくるう","あれるぎー","あわだてる","あんけーと","あんこーる","あんしょう","あんもにあ","いあわせる","いいあてる","いいかえす","いいかえる","いーすたー","いいつける","いいつたえ","いいまわし","いいわたす","いいんかい","いがくしょ","いきあたり","いきかえる","いきづまり","いきづまる","いきどおり","いきとどく","いきのこり","いきのこる","いきのびる","いさぎよい","いさましい","いしきてき","いじめっこ","いじらしい","いじわるい","いそがしい","いそぎあし","いたちょこ","いたましい","いたみどめ","いちがいに","いちきのう","いちぎょう","いちぎょう","いちこじん","いちこだて","いちじてき","いちだんと","いちつける","いちぶぶん","いちまわり","いちむかし","いちゃもん","いちりゅう","いっこうに","いっしゅん","いっしょう","いっしょく","いっせいに","いっちょう","いっぱんに","いっぺんに","いつまでも","いなかもの","いにしゃる","いのちがけ","いほうじん","いましめる","いまひとつ","いやがらせ","いやくひん","いやらしい","いやりんぐ","いよくてき","いりまじる","いれかえる","いれかわり","いれかわる","いれちがう","いろなおし","いろめがね","いわいごと","いんさいど","いんしょう","いんしょく","いんちょう","いんてりあ","いんどよう","いんぱくと","いんぷっと","いんりょう","いんりょく","ういすきー","ういにんぐ","ういんかー","ういんどー","うえーたー","うえすたん","うえつける","うぉーたー","うきあがる","うけいれる","うけつける","うけとめる","うけわたし","うしろあし","うしろだて","うしろむき","うすぐらい","うすっぺら","うずもれる","うちあける","うちあげる","うちあわせ","うちたてる","うちとける","うちやぶる","うつくしい","うつしだす","うったえる","うでどけい","うばいとる","うめたてる","うらおもて","うらがえす","うらづける","うらどおり","うらばなし","うりきれる","うりさばく","うりはらう","うるわしい","うれのこり","うれのこる","うわのそら","うわまわる","うんきゅう","うんてんし","えあらいん","えいがかん","えいきゅう","えいきょう","えいぎょう","えいじゅう","えいようか","えいようそ","えーでぃー","えきさいと","えきしょう","えきじょう","えきすとら","えげつない","えこのみー","えすけーぷ","えすさいず","えすにっく","えだわかれ","えちけっと","えっせんす","えとせとら","えねるぎー","えぴそーど","えむさいず","えめらるど","えるさいず","えれべーた","えろちっく","えんきょり","えんぐらふ","えんげーじ","えんじぇる","えんじにあ","えんしゅう","えんしゅつ","えんじょい","えんしょう","えんちょう","えんちょう","えんとりー","えんどれす","おいあげる","おいかえす","おいかける","おいしげる","おいたてる","おいつめる","おいはらう","おいまわす","おうきゅう","おうしゅう","おうしょく","おうちゃく","おうちょう","おうりょう","おおあたり","おおいそぎ","おおがかり","おおざっぱ","おおさわぎ","おーしゃん","おーでぃお","おおどおり","おーとばい","おーどぶる","おおみそか","おおむかし","おおもうけ","おおわらい","おかみさん","おきあがる","おきかえる","おくじょう","おくたーぶ","おくびょう","おくらせる","おくりこむ","おくりだす","おくりぬし","おくりもの","おじいさん","おしえこむ","おしかける","おしつける","おしのける","おしはかる","おしゃべり","おしよせる","おずおずと","おせあにあ","おせっかい","おそれいる","おそろしい","おっしゃる","おてあらい","おとうさん","おとこなき","おとこのこ","おとこまえ","おとこやく","おとしもの","おとずれる","おとなしい","おとろえる","おどろかす","おないどし","おにいさん","おにごっこ","おねえさん","おばあさん","おびやかす","おふさいど","おぷしょん","おぼえこむ","おむにばす","おむらいす","おめでたい","おめでとう","おもいいれ","おもいきり","おもいきり","おもいきる","おもいこみ","おもいこむ","おもいしる","おもいだす","おもいたつ","おもいつき","おもいつく","おもいやる","おもしろい","おもしろみ","おもてむき","おもんずる","おやごころ","おやふこう","おらんだご","おりかえし","おりかえす","おりじなる","おりまげる","おるごーる","おろかもの","おろしうり","おんがえし","おんがくか","おんきょう","おんちゅう","おんどけい","おんなのこ","おんらいん","おんりょう","かあちゃん","がーどまん","かーにばる","かーぺっと","がーりっく","かーりんぐ","かいかえる","かいかぶる","かいぎしつ","かいきゅう","かいきょう","かいぎょう","かいぎょう","かいけいし","がいこくご","かいしめる","かいしゃく","かいしゅう","かいしゅう","かいじゅう","がいしゅう","がいしゅつ","かいしょう","かいじょう","かいじょう","かいじょう","がいしょう","かいしょく","がいしょく","かいちゅう","がいちゅう","かいちょう","かいちょう","かいにゅう","かいばしら","かいひょう","がいやしゅ","がいやせき","がいらいご","がいりゃく","かいりょう","がいろじゅ","かいわぶん","かうんたー","かえりみち","かえりみる","かおあわせ","かおみしり","かがいしゃ","かかえこむ","かがくしゃ","かがくてき","かがくてき","かかりいん","かきいれる","かきかえる","かきとめる","かきなおす","かきまわす","かぎりない","かきわける","かくいつか","かくかぞく","がくぎょう","かくじゅう","がくしゅう","がくじゅつ","かくちょう","がくちょう","かくへいき","かくりょう","がくりょく","かけあがる","かけつける","かけぬける","かけまわる","かけめぐる","かごうぶつ","かざんたい","かしこまる","かじつしゅ","かじゅある","かじゅえん","かすたーど","がすぼんべ","かぜぐすり","かぜとおし","かせんしき","かぞえどし","かたおもい","かたくりこ","かたづける","かたむける","かたりあう","かたりつぐ","かちのこる","がっきゅう","がっきょく","がっしゅく","がっしょう","がっしょう","かっせいか","かっそうろ","かつりょく","かていてき","かてごりー","かとりっく","かならずや","かねもうけ","かねんせい","かのうせい","かはんしん","かはんすう","かまいたち","かみころす","かみだのみ","かみぶくろ","がむてーぷ","かむばっく","かめらまん","かもしだす","からだつき","からまわり","からみあう","からみつく","かりたてる","かりんとう","かるしうむ","かるちゃー","かれんだー","かろうじて","かわいがる","かわいそう","かわりだね","かわりばえ","かわりもの","かんがえる","かんかくき","かんがみる","かんきせん","かんきゃく","がんきゅう","かんきょう","かんじとる","かんしゅう","かんしょう","かんしょう","かんしょう","かんじょう","かんじょう","かんじょう","がんじょう","かんしょく","かんしょく","かんちがい","かんちゅう","かんちょう","かんちょう","かんちょう","かんでんち","かんとりー","かんにんぐ","かんぱにー","かんびょう","かんようく","かんりじん","かんりゃく","かんりょう","かんりょう","きーぼーど","きーわーど","きかいてき","きかんしゃ","ききいれる","ききおぼえ","ききかえす","ききつける","ききながす","ききのがす","ききわける","ききんぞく","ぎくしゃく","きけんせい","きげんぜん","ぎこうてき","きざみこむ","ぎじゅつや","ぎせいしゃ","きせきてき","きせつふう","ぎぜんしゃ","ぎたりすと","きっくおふ","きっさてん","きどうたい","きにはいる","ぎぶあっぷ","きほんてき","きめつける","きもちいい","ぎもんぶん","ぎゃくさつ","ぎゃくさん","きゃくしつ","きゃくせき","ぎゃくせつ","きゃくせん","ぎゃくたい","ぎゃくてん","きゃくひき","きゃくほん","きゃくよう","きゃすたー","きゃっかん","きゃっしゅ","きゃでぃー","きゃぷてん","きゃらめる","ぎゃらりー","きゃんせる","きゃんでー","きゃんどる","きゃんばす","きゃんぱす","ぎゃんぶる","きゅういん","きゅうえん","きゅうかい","きゅうかく","きゅうかん","きゅうかん","きゅうきょ","きゅうくつ","きゅうけい","きゅうけい","きゅうげき","きゅうけつ","きゅうこう","きゅうこう","きゅうさい","きゅうしき","きゅうじつ","きゅうじょ","きゅうしん","きゅうしん","きゅうじん","きゅうすい","きゅうすい","きゅうせい","きゅうぞう","きゅうそく","きゅうそく","きゅうそく","きゅうそく","きゅうだん","きゅうてい","きゅうでん","きゅうとう","ぎゅうどん","ぎゅうにく","きゅうへん","きゅうぼう","きゅうめい","きゅうよう","きゅうよう","きゅうれき","きょうあく","きょういく","きょういん","きょうえん","きょうかい","きょうかい","きょうかい","ぎょうかい","ぎょうかい","きょうかつ","きょうかん","きょうかん","きょうぐう","きょうくん","きょうけん","きょうげん","きょうこう","きょうこう","きょうざい","きょうさく","きょうさん","きょうしつ","きょうしゃ","ぎょうしゃ","ぎょうしゃ","きょうじゅ","きょうじゅ","ぎょうしゅ","きょうしん","きょうずる","きょうせい","きょうせい","きょうせい","ぎょうせい","ぎょうせき","きょうそう","きょうそう","きょうぞん","きょうだい","きょうだい","きょうだん","きょうつう","きょうてい","ぎょうてん","きょうとう","きょうどう","きょうどう","きょうばい","きょうはく","きょうふう","きょうほん","きょうめい","きょうゆう","きょうよう","きょうよう","きょうよう","きょうれつ","ぎょうれつ","ぎょぎょう","きょくげん","きょくせん","きょくたん","きょくとう","きょくばん","きょくめん","きょくもく","きょじゅう","きょひけん","きりあげる","きりおとす","きりかえし","きりかえる","きりかわる","きりきざむ","きりしたん","きりすてる","きりつめる","きりぬける","きりはなす","きりひらく","きろぐらむ","きろぐらむ","きろわっと","ぎんがけい","きんきゅう","きんきょう","きんきょり","ぎんせかい","きんだいか","きんちゃく","きんちょう","きんめだる","きんようび","きんりょく","くいちがい","くいちがう","くいつぶす","くいとめる","くうちゅう","くうちょう","くーでたー","くすりゆび","ぐたいさく","ぐたいてき","くだりざか","くちあたり","くちぐちに","くちずさむ","くちづたえ","くつがえす","くっきんぐ","くつじょく","くっしょん","くっつける","くみあわせ","くみいれる","くみきょく","くみたてる","くやくしょ","ぐらうんど","くらしっく","くらしむき","くらっかー","くらべもの","ぐらんぷり","くりあげる","くりーなー","くりかえし","くりかえす","くりけっと","くりすたる","くりすます","くりにっく","くるしめる","くれーじー","くれーたー","くれじっと","くれんざー","くろーばー","ぐろーばる","ぐろてすく","ぐんしゅう","くんしょう","けいじばん","げいじゅつ","けいしょう","けいしょう","けいしょう","けいじょう","けいむしょ","けいようし","けいりゅう","けいりょう","けいりょう","げきじょう","げすいどう","けずりぶし","けたちがい","けちゃっぷ","けっかてき","げっきゅう","けっきょく","げっしゅう","けっしょう","けっしょう","けつじょう","けっちゃく","げつようひ","けんきゅう","げんきゅう","けんぎょう","げんきょう","げんごがく","げんしてき","げんじてん","けんしゅう","けんじゅう","げんじゅう","げんしゅく","けんしゅつ","けんしょう","けんしょう","けんじょう","けんじょう","げんしょう","げんしょう","げんじょう","げんしょく","げんしょく","けんたいき","げんだいご","けんちくし","けんちょう","けんばいき","げんりょう","げんりょう","けんりょく","ごあいさつ","こいごころ","こいのぼり","こういてき","こうかてき","こうきあつ","こうきしん","こうきゅう","こうきゅう","ごうきゅう","こうきょう","こうきょう","こうきょう","こうぎょう","こうぎょう","こうくうき","こうけいき","こうさてん","こうしゅう","こうしゅう","こうしゅう","こうしょう","こうしょう","こうじょう","こうじょう","こうたいし","こうちょう","こうちょう","こうちょう","こうにゅう","こうねつひ","こうばしい","こうはんい","こうひょう","こうひょう","こうひょう","こうみょう","こうむいん","こうようご","ごうりてき","こうりゃく","こうりゅう","ごうりゅう","こうりょう","こうりょく","こえがわり","ごーじゃす","こーすたー","こおりみず","ごーるでん","こきゅうき","こくさいか","ここちよい","ここなっつ","こころえる","こころから","こころざし","こころざす","こころない","こころまち","こころみに","こころみる","こころもち","こころよい","こしかける","こじんてき","こじんめい","こせいてき","こちらこそ","こっきょう","こてんてき","ことごとく","ことたりる","このましい","こびりつく","こみあげる","こめでぃー","こようしゃ","こらーげん","こらしめる","ごるふぁー","これくたー","ころしあむ","ころもがえ","こわれもの","こんくーる","こんさーと","こんじゃく","こんしゅう","こんしゅん","こんじょう","こんせぷと","こんたくと","こんちゅう","こんてすと","こんどーむ","こんにちは","こんにゃく","こんにゅう","こんねんど","こんねんど","こんぱくと","こんばんは","こんべやー","さーきっと","さーふぁー","さーふぃん","さいきょう","さいこうび","さいしゅう","さいしゅう","ざいじゅう","さいしょう","さいしょう","さいじょう","ざいしょく","さいせいき","さいちゅう","ざいちゅう","さいちょう","さいどかー","さいにゅう","さいぶんか","ざいりゅう","さいりょう","ざいりょう","さがしだす","さかのぼる","さきおくり","さきがける","さくらもち","さくりゃく","さけくさい","ささめごと","さしあげる","さしいれる","さしおさえ","さしかえる","さしころす","さしつかえ","さしとめる","さしのべる","さすぺんす","さそいこむ","ざだんかい","さっきゅう","さっきょく","さっしょう","さつじんき","さっちゅう","さとがえり","さばいばる","さふぁいあ","さぽーたー","さまがわり","さまたげる","さようなら","さらいねん","さりげない","さわがしい","さんかいき","さんぎいん","さんきゃく","ざんぎゃく","さんきゅう","さんぎょう","ざんぎょう","さんぐらす","さんじゅう","さんしゅつ","さんしゅつ","さんしょう","さんしょく","さんせいう","さんちゅう","さんちょう","さんにゅう","さんまいめ","さんみゃく","さんりゅう","ざんりゅう","じいちゃん","しーでぃー","しーふーど","じえいたい","しぇーばー","しぇるたー","じぇんだー","しおかげん","しおからい","しがいせん","しかたない","しがみつく","じかんがい","じかんわり","しきじょう","しきちょう","じきてーぷ","じぎょうか","しくはっく","しけんかん","しけんてき","しごとがら","じしゅてき","ししゅんき","しぜんかい","じそんしん","じだいげき","したがえる","したしらべ","したまわる","しちごさん","しつぎょう","じっきょう","じっしゅう","じっしょう","じつじょう","じつようか","しつりょう","じつりょく","していせき","じてんしゃ","じどうしゃ","じどうてき","しのびこむ","しのびよる","じばいせき","じはつてき","しぼうりつ","しぼりこむ","しみんけん","じむきょく","しめつける","しもばしら","じゃーじー","しゃーぺん","じゃがいも","じゃくしゃ","しやくしょ","じゃくてん","しゃくはち","しゃくほう","しゃくよう","じゃけっと","しゃしょう","しゃじょう","しゃしんか","しゃしんき","しゃしんや","じゃすみん","しゃだんき","しゃちゅう","しゃちょう","じゃっかん","しゃっきん","しゃっくり","しゃったー","しゃりょう","じゃんぐる","じゃんけん","じゃんぱー","しゃんぱん","しゃんぷー","しゅうえき","じゅうおう","しゅうかい","しゅうかく","しゅうがく","じゅうがつ","しゅうかん","しゅうかん","しゅうかん","じゅうきょ","しゅうきん","しゅうけい","しゅうげき","しゅうけつ","じゅうけつ","しゅうごう","じゅうこう","じゅーさー","じゅうじか","しゅうじつ","じゅうじつ","しゅうしふ","じゅうしょ","しゅうしん","しゅうしん","しゅうじん","じゅうしん","しゅうせい","じゅうぜい","しゅうせき","しゅうせん","しゅうぜん","じゅうそく","じゅうぞく","じゅうたい","じゅうだい","じゅうだい","じゅうだい","じゅうたく","しゅうだん","じゅうたん","じゅうだん","じゅうだん","しゅうてん","しゅうでん","じゅうてん","じゅうでん","しゅうとう","じゅうどう","しゅうとく","しゅうとく","しゅうとめ","じゅうなん","しゅうにん","じゅうにん","しゅうのう","しゅうはい","しゅうばん","しゅうふく","じゅうふん","じゅうぶん","じゅうぶん","しゅうへん","しゅうまつ","じゅうみん","しゅうやく","じゅうやく","しゅうゆう","しゅうよう","じゅうよう","じゅうよう","じゅうらい","しゅうらく","しゅうろう","しゅうろく","じゅうろく","じゅえりー","じゅきゅう","しゅぎょう","しゅぎょう","じゅきょう","じゅぎょう","しゅくじつ","しゅくしゃ","じゅくすい","じゅくする","じゅくせい","しゅくだい","じゅくどく","じゅくねん","しゅくはく","しゅくふく","しゅくめい","じゅくれん","しゅじゅつ","しゅしょう","じゅしょう","しゅしょく","じゅしんき","しゅだいか","じゅちゅう","しゅちょう","しゅつえん","しゅつがん","しゅっきん","しゅっけつ","しゅっけつ","しゅつげん","しゅっこう","しゅっこう","しゅっこく","しゅっさん","しゅっしゃ","しゅっしょ","しゅっしん","しゅっせき","しゅつだい","しゅってい","しゅっとう","しゅっぱつ","しゅっぱん","しゅっぴん","しゅつぼつ","しゅとけん","じゅみょう","しゅりゅう","しゅりょう","じゅりょう","しゅりょく","じゅんあい","じゅんかい","じゅんかつ","しゅんかん","じゅんかん","しゅんぎく","じゅんじょ","じゅんすい","じゅんずる","じゅんせい","じゅんとう","じゅんのう","じゅんぱく","じゅんばん","じょいんと","じょういん","じょうえい","しょうえね","じょうえん","しょうおん","じょうおん","しょうかい","しょうかい","しょうかい","しょうがい","しょうがい","しょうがい","しょうかき","しょうかく","しょうがく","しょうがつ","しょうきょ","しょうきん","じょうきん","じょうくう","しょうぐん","じょうけい","しょうげき","しょうけん","しょうげん","じょうけん","じょうげん","しょうこう","しょうごう","じょうこう","しょうさい","しょうさん","しょうさん","しょうしか","しょうじき","しょうじき","じょうしき","しょうしつ","じょうしつ","しょうしゃ","しょうしゃ","しようしゃ","じょうしゃ","しょうしょ","しょうじょ","しょうじる","しょうしん","じょうすい","しょうすう","しょうすう","しょうする","しょうずる","じょうせい","しょうせつ","じょうせん","しょうぞう","じょうそう","じょうぞう","しょうそく","しょうたい","しょうたい","じょうたい","じょうたい","しょうだく","じょうたつ","しょうだん","じょうだん","じょうだん","じょうちょ","しょうてん","しょうてん","しょうとう","しょうどう","じょうとう","しょうどく","しょうとつ","しょうにか","しょうにん","しょうにん","しょうにん","じょうねつ","しょうねん","しょうはい","しょうばい","じょうはつ","しょうひん","しょうひん","じょうひん","じょうぶつ","しょうべん","しょうほう","しょうぼう","じょうほう","しょうめい","しょうめい","しょうめつ","しょうめん","しょうもう","じょうやく","じょうよう","しょうらい","じょうりく","しょうりつ","じょうるり","しょうれい","じょうれい","じょうれん","しょきゅう","しょきゅう","じょきょく","じょぎんぐ","しょくいん","しょくえん","しょくざい","しょくしゅ","しょくする","しょくぜん","しょくたく","しょくつう","しょくどう","しょくどう","しょくにく","しょくにん","しょくはつ","しょくひん","しょくぶつ","しょくぶつ","しょくみん","しょくもつ","しょくよう","しょくよく","しょくれき","しょざいち","しょじゅん","じょじょに","しょちゅう","じょちゅう","しょちょう","しょっかく","しょっけん","しょっぱい","じょどうし","しょるだー","しょんぼり","しらがぞめ","しりぞける","しりんだー","しるえっと","しれいかん","じんいてき","しんきゅう","しんきゅう","しんきょう","しんきょく","しんげんち","じんけんひ","しんこくか","しんじゅう","しんしゅく","しんしゅつ","しんじょう","しんじょう","じんじょう","しんしょく","しんせいじ","しんちょう","しんちょう","しんちょう","しんてんち","しんにゅう","しんにゅう","しんにゅう","しんぴてき","しんふぜん","しんぶんし","じんみゃく","しんりがく","しんりてき","しんりゃく","しんりょう","しんりょく","すいあげる","すいじゃく","すいじゅん","すいじょう","すいちゅう","すいちょく","すいはんき","すいようび","すいりゅう","すいりょう","すいりょく","すうりょう","すきーやー","すきかって","すききらい","すきこのむ","すきとおる","すくーたー","すくりーん","すくりゅー","すさまじい","すたーたー","すたんばい","すてぃっく","すてーたす","すてっかー","すてんれす","すとーりー","すとっぱー","すとらいき","すとらいく","すとらいぷ","すとらっぷ","すとりーと","すとりっぷ","すとれーと","すとれっち","すなあらし","すにーかー","ずばぬける","すばらしい","すぴーかー","すぴりっと","すぷりんぐ","すぺしゃる","すべりこむ","すぽんさー","すまっしゅ","すみません","すもうとり","すらいだー","すらっくす","ずりおちる","すりきれる","すりつぶす","ずるやすみ","すれちがい","すれちがう","すろーがん","すわりこむ","せいかつひ","せいぎかん","せいきまつ","せいきゅう","せいきょう","せいきょう","せいこうい","せいじがく","せいじてき","せいじゃく","ぜいしゅう","せいしゅく","せいじゅく","せいしゅん","せいじょう","せいじょう","せいちょう","せいちょう","せいでんき","せいとうは","せいとかい","ぜいむしょ","せいりてき","せいりゃく","せいりゅう","せいりょう","せいりょう","せいりょく","せいりょく","せかいかん","せかいてき","せくしゃる","せくしょん","せけんてき","せたいぬし","せっきゃく","せっきょう","せっきょく","せっしょう","せっしょく","せつぞくし","ぜったいち","せっちゃく","ぜつみょう","せぱれーつ","せばんごう","せめたてる","せれもにー","せろてーぷ","せんきょう","せんぎょう","せんきょく","せんきょく","ぜんきょく","ぜんこくく","せんしゅう","ぜんしゅう","せんしゅつ","せんじゅつ","ぜんじゅつ","せんしょう","せんしょう","せんじょう","せんじょう","せんじょう","ぜんしょう","せんしょく","せんたくき","せんたくし","せんちゃく","せんちょう","ぜんちょう","ぜんちょう","せんとうき","せんとらる","せんにゅう","せんぷうき","せんめんき","せんもんか","せんりひん","せんりゃく","ぜんりゃく","せんりゅう","せんりょう","せんりょう","ぜんりょう","せんりょく","ぜんりょく","そうぎしゃ","そうきゅう","そうぎょう","ぞうきょう","そうじゅう","そうしょう","そうしょく","ぞうしょく","そうせいじ","そうちゃく","そうちょう","そうちょう","そうにゅう","そうりょう","そうりょう","ぞうりょう","そーせーじ","ぞくしゅつ","ぞくしょう","そくりょう","そっきゅう","そっきょう","そつぎょう","そっちょく","そとまわり","そなえつけ","そなえもの","そのかわり","そめあげる","そんけいご","そんげんし","そんしょう","そんちょう","そんちょう","たーげっと","たーみなる","だいえっと","だいかぞく","たいきゅう","だいきらい","たいしかん","だいしぜん","たいしゃく","たいしゅう","たいしゅう","たいじゅう","たいしゅつ","たいしょう","たいしょう","たいしょう","たいしょう","たいしょう","たいしょう","たいじょう","だいしょう","だいしょう","たいしょく","だいそれた","だいたすう","たいちょう","たいちょう","たいちょう","たいちょう","だいちょう","だいちょう","だいとかい","だいどころ","だいにんぐ","だいひょう","だいびんぐ","だいぶぶん","だいみょう","たいみんぐ","たいむりー","だいめいし","だいりせき","だいりてん","たいりょう","たいりょう","たいりょく","だいれくと","たからもの","だきあげる","たきしーど","だきしめる","たくじしょ","たくじょう","たくましい","たくわえる","たこくせき","たしかめる","たすうけつ","たすけあう","たずさわる","たたきこむ","たたきだす","たちあがり","たちあがる","たちどまる","たちなおる","たちならぶ","たちのぼる","たちばなし","たちむかう","たっきゅう","だっしゅう","だっしゅつ","だっしょく","たてかえる","たてなおす","たどりつく","たにんずう","たねあかし","たのみこむ","たのもしい","たびやかた","たべものや","だまりこむ","ためんてき","たもくてき","だらしない","たんきかん","たんきゅう","たんきゅう","たんきょり","たんじかん","たんしゅく","たんじゅん","たんじゅん","たんじょう","たんちょう","たんちょう","だんちょう","だんでぃー","たんばりん","ちからぞえ","ちからもち","ちきゅうぎ","ちくしょう","ちしきじん","ちずちょう","ちへいせん","ちほうじち","ちめいてき","ちゃーたー","ちゃーはん","ちゃいろい","ちゃくじつ","ちゃくしゅ","ちゃくせき","ちゃくにん","ちゃくよう","ちゃくりく","ちゃっこう","ちゃばしら","ちゃぶだい","ちゃれんじ","ちゃんねる","ちゃんぽん","ちゅうおう","ちゅうかい","ちゅうがく","ちゅうから","ちゅうかん","ちゅうけい","ちゅうけん","ちゅうげん","ちゅうこく","ちゅうざい","ちゅうじつ","ちゅうしゃ","ちゅうしゃ","ちゅうしん","ちゅうすう","ちゅうせい","ちゅうせい","ちゅうせい","ちゅうぜつ","ちゅうせん","ちゅうたい","ちゅうだん","ちゅうちょ","ちゅうとう","ちゅうどく","ちゅーなー","ちゅうねん","ちゅうばん","ちゅうぼう","ちゅうもく","ちゅうもん","ちゅうりつ","ちゅうりん","ちょういん","ちょうえき","ちょうかく","ちょうかん","ちょうかん","ちょうこう","ちょうこう","ちょうごう","ちょうこく","ちょうしゃ","ちょうじゃ","ちょうしゅ","ちょうじゅ","ちょうしょ","ちょうじょ","ちょうじん","ちょうせい","ちょうせつ","ちょうせん","ちょうそん","ちょうだい","ちょうだい","ちょうたつ","ちょうちん","ちょうてい","ちょうてん","ちょうない","ちょうなん","ちょうにん","ちょうはつ","ちょうはつ","ちょうばつ","ちょうふく","ちょうぶん","ちょうへい","ちょうへん","ちょうほう","ちょうみん","ちょうめい","ちょうりし","ちょうりつ","ちょくえい","ちょくげき","ちょくしゃ","ちょくしん","ちょくせつ","ちょくせつ","ちょくせん","ちょくぜん","ちょくぞく","ちょくつう","ちょくめん","ちょくやく","ちょくりつ","ちょくれつ","ちょっかく","ちょっかん","ちょっかん","ちょっけい","ちょっけつ","ちょっこう","ちょっぴり","ちょんまげ","ちんじゅつ","ちんちゃく","ちんちょう","ついきゅう","ついきゅう","つうしょう","つうじょう","つうしんぼ","つうちょう","つーりすと","つーりんぐ","つかいこむ","つかいすて","つかいみち","つかいもの","つかいわけ","つかさどる","つかまえる","つかまえる","つきあたり","つきあたる","つきおとす","つきささる","つきっきり","つきつめる","つきとばす","つきとめる","つきぬける","つきやぶる","つくりだす","つくりもの","つけあわせ","つけかえる","つたえきく","つっかかる","つっぱしる","つとめさき","つとめにん","つみあげる","つみたてる","つめあわせ","つめかえる","つめかける","つりあげる","つりさげる","つれもどす","つんのめる","でぃーえむ","でぃーぜる","てぃーぶい","でぃーらー","ていきあつ","ていきけん","ていきてき","ていきゅう","ていきょう","ていきんり","ていしせい","ていじせい","ていじゅう","ていしゅつ","ていしょう","ていしょく","ていしょく","ていちゃく","ていちょう","てぃっしゅ","でぃてーる","ていねいご","ていひょう","でいりくち","てーぴんぐ","できあがり","できあがる","てきりょう","できるだけ","てきれいき","てくにかる","てくにっく","でざいなー","でじたるか","でしゃばる","てつけきん","でむかえる","でめりっと","でゅえっと","でらっくす","でりけーと","てりょうり","てろりすと","てんかんき","でんききぐ","でんきゅう","でんきょく","てんしゅつ","てんじょう","てんじょう","でんしょう","てんしょく","てんしょく","てんしょん","でんちゅう","てんにゅう","でんぴょう","でんりゅう","でんりょく","といあわせ","といかえす","といかける","といれっと","とうがらし","とうきゅう","とうきゅう","どうきゅう","どうぎょう","とうきょく","とうじしゃ","どうじだい","とうしゅう","とうじょう","とうじょう","どうじょう","どうじょう","どうじょう","どうじょう","とうちゃく","とうちょう","とうちょう","どうちょう","とうにゅう","とうにゅう","どうにゅう","とうにょう","とうひょう","どうみゃく","どうめだる","どうりょう","どうりょう","どうりょく","とおざかる","とおざける","とーすたー","どーぴんぐ","とおまわし","とおまわり","とおりこす","とおりぬけ","ときたまご","ときはなす","とくしゅう","とくしょく","とくちゅう","とくちょう","とくちょう","とくはいん","とけいだい","ところてん","としおいる","としこっか","とじこめる","としのくれ","としょかん","としょしつ","とっきゅう","とっきゅう","どっきんぐ","どっちみち","とっちめる","とっておき","とつにゅう","とどけでる","とどこおる","ととのえる","となりあう","どのくらい","とびあがる","とびおきる","とびおりる","とびこえる","とびまわる","ともかせぎ","どらいばー","どらいやー","とらべらー","どらむかん","どらむすこ","とらわれる","とらんくす","とりあえず","とりあげる","とりいれる","とりかえし","とりかえす","とりかえる","とりかこむ","とりきめる","とりこわす","とりさげる","とりしきる","とりしまり","とりしまる","とりしらべ","とりつける","とりのこす","とりのぞく","とりはずし","とりはずす","とりもどす","とりやめる","とりよせる","とりわける","とるねーど","とれーなー","とれーらー","どろだらけ","とろふぃー","ないしょく","ないやしゅ","ながしこむ","ながしだい","ながつづき","なかなおり","なかまいり","なかやすみ","ながれこむ","なきさけぶ","なぐさめる","なげいれる","なげかける","なげすてる","なげとばす","なさけない","なしとげる","なしょなる","なちゅらる","なつかしい","なつかしむ","なつじかん","なつまつり","なつやすみ","なとりうむ","なにひとつ","なのりでる","なまぐさい","なまじっか","なまたまご","なまびーる","なみだぐむ","なやましい","ならいごと","なりあがる","なれーたー","なんきょく","なんせんす","なんちょう","にがわらい","にきょくか","にくしょく","にげまわる","にちあたり","にちじょう","にちようび","にっきゅう","にっしょう","にっちゅう","にほんしゅ","にめんせい","にゅあんす","にゅういん","にゅうえき","にゅうえん","にゅうかい","にゅうがく","にゅうかん","にゅうきょ","にゅうきん","にゅうこう","にゅうこく","にゅうさつ","にゅうさん","にゅうしつ","にゅうしゃ","にゅうしゅ","にゅうせき","にゅうたい","にゅうだん","にゅーとん","にゅうもん","にゅうよく","にょうぼう","にりんしゃ","にんぎょう","にんげんみ","にんしょう","にんじょう","ぬいぐるみ","ぬりぐすり","ぬりたくる","ねーみんぐ","ねがいごと","ねがいでる","ねがてぃぶ","ねころがる","ねっきょう","ねっくれす","ねっちゅう","ねつりょう","ねむりこむ","ねんがっぴ","ねんきゅう","ねんしゅう","ねんじゅう","ねんじゅう","ねんしょう","ねんしょう","ねんちゃく","ねんちょう","ねんぴょう","ねんりょう","のいろーぜ","のうきょう","のうぎょう","のうしゅく","のうじょう","のうりょく","のこりもの","のぞきこむ","のぞましい","のびなやむ","のぼりおり","のぼりざか","のみねーと","のめりこむ","のりあげる","のりいれる","のりかえる","のりこえる","のりごこち","のりまわす","ぱーきんぐ","ばーじょん","ばーすでー","ぱーせんと","ぱーせんと","ぱーそなる","ばあちゃん","ぱーてぃー","ぱーとなー","はいうえー","ぱいおにあ","ばいおりん","はいきがす","ばいきゃく","はいきゅう","はいきんぐ","ばいきんぐ","はいしゃく","ばいしゃく","ばいしゅう","はいしゅつ","ばいしゅん","ばいしょう","はいしょく","はいひーる","ぱいぷやく","はいらいと","はいりこむ","ぱいろっと","はかいてき","はかまいり","ばかやろう","ばからしい","はきすてる","はくしゃく","ばくしょう","はくしょく","はくちょう","ばくてりあ","はくりきこ","はくりょく","はじきだす","はしやすめ","はしわたし","はずかしい","ぱすぽーと","ばするーむ","ぱすわーど","はださむい","ばたふらい","はたらかす","はたらきて","はちじゅう","ぱっけーじ","はっしょう","はっしょう","はっしょく","はっちゃく","はっちゅう","ばってりー","はつばしょ","はつびょう","はっぴょう","はつもうで","ぱとろーる","はなざかり","はなしあい","はなしあう","はなしごえ","はなしこむ","はなばたけ","はねあがる","はねかえす","はねつける","はねむーん","はばひろい","はぷにんぐ","ぱぶりっく","はむすたー","はやうまれ","はやがわり","ぱらだいす","はらのなか","はりかえる","ばりけーど","はりけーん","はりつける","ばるこにー","はるやすみ","はれあがる","ばれりーな","ぱろでぃー","はわいあん","はんかがい","はんきゅう","はんきょう","はんぐりー","ぱんけーき","はんこうき","ばんごはん","ばんしゃく","はんじゅく","はんじょう","はんしょく","はんずぼん","ばんちょう","ぱんてぃー","はんばーぐ","ぴあにすと","ぴあのせん","ぴーあーる","ぴーなっつ","ひえしょう","ひがいしゃ","ひかえしつ","ひかくてき","ひがしがわ","ひがしむき","ひかんてき","ひきあげる","ひきいれる","ひきうける","ひきおこす","ひきかえす","ひきさがる","ひきさげる","ひきしまる","ひきしめる","ひきたてる","ひきつける","ひきつづく","ひきでもの","ひきはなす","ひきよせる","ひきわける","ひきわたし","ひきわたす","ぴくちゃー","ぴくにっく","ひけんしゃ","ひこうかい","ひこうせん","ひざまくら","ひしゃたい","びじゅある","びすけっと","びせいぶつ","ひだりあし","ひだりがわ","ひだりきき","ひだりはし","ひっかかる","ひっかける","ひっこぬく","ひっこめる","ひっしょう","びっしょり","ぴっちゃー","ぴっちんぐ","ひていてき","ひとあたり","ひとくふう","ひととおり","ひとまかせ","ひとまとめ","ひとみしり","ひとむかし","ひとやすみ","ひとりごと","ひとりじめ","ひとりだち","ひとりっこ","ひとりでに","ひとりもの","ひなまつり","ひねくれる","ひのくるま","ひはんてき","びぶらーと","ひやくてき","ひゃくねん","ひゃくまん","ひややっこ","ひゅーまん","びょういん","びよういん","ひょうげん","ひょうこう","ひょうさつ","ひょうざん","ひょうしき","びょうしつ","びょうしゃ","びょうしん","ひょうたん","ひょうてい","ひょうてき","びょうとう","びょうどう","びょうにん","ひょうはく","ひょうばん","ひょうめい","びょうめい","ひょうめん","びょうよみ","ひょうろん","ひょっこり","ぴらみっど","びりやーど","ひるがえす","ひるがえる","ひるごはん","ひるさがり","ひるやすみ","ひんじゃく","ひんしゅく","びんじょう","ぴんせっと","びんてーじ","ふぁいたー","ふぁいなる","ふぁいばー","ふぁすなー","ふぁっくす","ふぁみりー","ふあんかん","ふあんてい","ふぃーばー","ふぃーるど","ふぃぎゅあ","ふぃじかる","ふぃっしゅ","ぶいねっく","ふぃるたー","ぶーいんぐ","ふうしゅう","ふうちょう","ふうぶつし","ぶーめらん","ふうりゅう","ふうりょく","ふえいせい","ふぇろもん","ふぉーかす","ふぉーまる","ふぉわーど","ふかぶかと","ふかんぜん","ふきあげる","ふきかえす","ふきとばす","ふきんこう","ふきんしん","ふくぎょう","ふくさよう","ふくしゅう","ふくしゅう","ふくじゅう","ふくしょく","ふくとしん","ふくぶくろ","ふくらはぎ","ふくらます","ふけんぜん","ふごうかく","ふこうへい","ふさわしい","ふしあわせ","ふしょうじ","ふしんかん","ふしんせつ","ふしんにん","ふせっせい","ふぞくひん","ぶちあける","ふちゅうい","ふつかよい","ふっきゅう","ぶっきょう","ふっきれる","ぶつりがく","ぶつりてき","ぶつりゅう","ぶてぃっく","ぷでぃんぐ","ふてきとう","ふどうさん","ふとうめい","ふとくてい","ふひつよう","ぶぶんてき","ふへんてき","ふみいれる","ふみたおす","ふゆやすみ","ぶらいだる","ふらいぱん","ふらいんぐ","ぶらいんど","ぷらかーど","ぶらさがる","ぶらさげる","ぶらじゃー","ぷらもでる","ふらんすご","ぶらんでー","ふりーたー","ふりかえる","ふりそそぐ","ふりはらう","ふりまわす","ふりわける","ぷりんせす","ぷりんたー","ふるねーむ","ふるはうす","ふるぼける","ぶれいこう","ぷれーおふ","ぶれーかー","ぷれーやー","ぷれぜんと","ふれっしゅ","ぷれみあむ","ふろうしゃ","ふろーずん","ぷろぐらむ","ふろっぴー","ぷろぽーず","ぷろろーぐ","ふろんがす","ぶんかざい","ぶんかじん","ぶんかてき","ぶんきてん","ぶんぎょう","ぶんしゅう","ふんしゅつ","ぶんしょう","ぶんじょう","ぶんちゅう","ぶんぼうぐ","ぶんみゃく","ぶんりょう","へいきんち","へいじょう","へいりょく","べーかりー","べーしっく","へくたーる","へっどほん","べにやいた","へるめっと","へんきゃく","べんきょう","へんきょく","へんしゅう","べんしょう","へんしょく","へんしょく","ぺんしょん","ぺんたごん","ぺんだんと","べんちゃー","ぺんねーむ","ほいくえん","ほいくしょ","ぼいこっと","ほいっする","ぼうきゃく","ほうしゅう","ぼうしゅう","ほうしゅつ","ぼうちゅう","ほうちょう","ぼうちょう","ぼうちょう","ぼうはてい","ほうりこむ","ほうりだす","ほうりゅう","ぼうりょく","ぼうりんぐ","ぽーたぶる","ほーむれす","ぼーるぺん","ほくじょう","ぼくじょう","ぼくしんぐ","ほけんきん","ほこうしゃ","ぼしかてい","ぽじしょん","ほしゅてき","ほじょきん","ほそながい","ぽたーじゅ","ほちょうき","ほっきょく","ほっさてき","ぼっしゅう","ぽっちゃり","ほとけさま","ほどとおい","ぽぴゅらー","ほりおこす","ほりさげる","ぽりぶくろ","ぼりゅーむ","ぽろしゃつ","ぼんおどり","ほんかくか","ほんぎょう","ほんしゅう","ほんしょう","ほんしょく","ほんとうに","ぼんねっと","ほんみょう","ほんるいだ","まーがりん","まーけっと","まいあがる","まいしゅう","まいしょく","まいびょう","まいぺーす","まえばらい","まかふしぎ","まがりかど","まきあげる","まきおこす","まぎれこむ","まじしゃん","ましゅまろ","ますかっと","ますこっと","ますたーど","まちあわせ","まちうける","まちがえる","まっくろい","まっさーじ","まっしょう","まっしろい","まっとれす","まっぷたつ","まどがらす","まとはずれ","まにあっく","まにきゅあ","まにゅある","まぬがれる","まねきねこ","まのあたり","まもりがみ","まよねーず","まるっこい","まわりみち","まんがいち","まんじゅう","まんしょん","まんびょう","まんほーる","みあわせる","みうしなう","みえかくれ","みかいけつ","みかんせい","みぎひだり","みぎまわり","みきわめる","みくらべる","みぐるしい","みけいけん","みずあそび","みずあらい","みずかげん","みずしげん","みすてりー","みずのあわ","みずびたし","みずまわり","みせいねん","みせかける","みちがえる","みちじゅん","みちしるべ","みっしゅう","みっしょん","みっちゃく","みでぃあむ","みとどける","みどりいろ","みなごろし","みなみがわ","みなみむき","みにちゅあ","みのまわり","みはからう","みぼうじん","みみざわり","みやげもの","みょうにち","みょうばん","みりおねあ","みりぐらむ","みんしゅう","みんしゅく","むかいあう","むかいかぜ","むかいがわ","むかんけい","むかんしん","むけいかく","むこうがわ","むしあつい","むしかえす","むしょうに","むしょぞく","むしんけい","むずかしい","むすびつき","むすびつく","むせいげん","むせきにん","むだづかい","むめんきょ","めいきょく","めいごさん","めいしょう","めいりょう","めかにずむ","めかにっく","めがへるつ","めぐまれる","めぐりあう","めざましい","めしあがる","めしつかい","めずらしい","めだりすと","めたりっく","めっせーじ","めもりある","めろでぃー","めんじょう","めんしょく","めんちかつ","もうしこみ","もうしこむ","もうしたて","もうしでる","もうしぶん","もうじゅう","もうしわけ","もうちょい","もえあがる","もえつきる","もーしょん","もーにんぐ","もくひょう","もくようび","もちあがる","もちあげる","もちかえり","もちかえる","もちかける","もちはこび","もちはこぶ","もてあます","もてはやす","もどかしい","ものがたり","ものがたる","ものごころ","ものしずか","ものすごい","ものれーる","ももたろう","もりあがる","もりあげる","もりあわせ","もんしょう","もんすたー","やおちょう","やかましい","やきあげる","やきつける","やきはらう","やくざいし","やくしょく","やくだてる","やくどころ","やすあがり","やすっぽい","やっきょく","やっつける","やぼったい","やまのぼり","ややこしい","やわらかい","やわらかい","やわらげる","ゆうえんち","ゆうきぶつ","ゆうきゅう","ゆうしゅう","ゆうしゅう","ゆうしょう","ゆうじょう","ゆうしょく","ゆうすずみ","ゆうほどう","ゆーもらす","ゆうりょう","ゆうりょう","ゆうりょく","ゆきおろし","ゆきおんな","ゆきすぎる","ゆきまつり","ゆだやじん","ゆにほーむ","ようぎしゃ","ようきゅう","ようしょう","ようしょく","ようしょく","ようするに","ようちえん","ようちゅう","ようりょう","ようりょう","よーぐると","よーろっぱ","よくしゅう","よくじょう","よくちょう","よこたわる","よこなぐり","よせつける","よちょきん","よっきゅう","よっぱらい","よっぱらう","よびおこす","よびかける","よびちしき","よびとめる","よびもどす","よみあげる","よみかえす","よみがえる","よりかかる","らいきゃく","らいしゅう","らいしゅん","らいせんす","らくしょう","らしんばん","らっかせい","らっきょう","らべんだー","らんきんぐ","らんどせる","らんどりー","らんにんぐ","りーぐせん","りきゅーる","りきりょう","りくえすと","りくじょう","りくるーと","りさいくる","りそうてき","りっこうほ","りっしゅう","りっしゅん","りっしょう","りはーさる","りばうんど","りはつてん","りふぉーむ","りゃくしき","りゃくだつ","りゃくれき","りゅういき","りゅうがく","りゅうこう","りゅうさん","りゅうざん","りゅうつう","りゅうどう","りゅうねん","りゅーまち","りょうあし","りょういき","りょううで","りょうかい","りょうがえ","りようかち","りょうがわ","りょうきん","りょうこう","りょうさん","りょうしき","りょうしつ","りょうしゃ","りょうしゅ","りょうしん","りょうしん","りょうせい","りょうたん","りょうてい","りょうひん","りょうほう","りょうほう","りょうめん","りょうやく","りょうよう","りょうりつ","りょうりや","りょかくき","りょくちゃ","りらっくす","りれきしょ","りろんてき","りんぎょう","りんじゅう","りんしょう","りんりてき","るーれっと","るねさんす","れいあうと","れいきゃく","れいじょう","れいぞうこ","れきしてき","れぎゅらー","れこーだー","れすとらん","れすりんぐ","れぽーたー","れんきゅう","れんしゅう","れんしょう","れんたかー","れんとげん","ろうりょく","ろーしょん","ろーたりー","ろくじゅう","ろんじゅつ","ろんりてき","わいしゃつ","わいやれす","わかいもの","わかがえり","わきあがる","わきまえる","わすれもの","わだかまり","わたりどり","わっしょい","わりあいに","わりあてる","われさきに","わんたっち","わんだふる","わんぴーす","わんりょく"];
var submittedCharacters = [];
var gojuon = "あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんがぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽゃゅょぁぃぅぇぉっー"
makeGojuon();
var today = new Date();
var month = today.getUTCMonth() + 1;
var monthString = "";
var day =  today.getUTCDate();
var dayString = "";
if (month < 10) {
    monthString = "0" + month.toString(); 
} else {
    monthString = month.toString();
}
if (day < 10) {
    dayString = "0" + day.toString(); 
} else {
    dayString = day.toString();
}
var seed = "";
document.getElementById("seed-text-box").value = "" + today.getFullYear() + monthString + dayString;

function seedSubmit() {
    var seedInput = document.getElementById("seed-text-box").value;
    correctAnswer = answers[parseInt(seedInput) * 2147483647 % answers.length];
    submittedCharacters = [];
    makeGojuon();
    var displayArea = document.getElementById("display-area");
    var displayClone = displayArea.cloneNode( false );
    displayArea.parentNode.replaceChild( displayClone , displayArea );
    document.getElementById("seed-description").innerText="シード値から答えが生成されました！";
    attempt = 0;
    endgame = false;
    seed = seedInput;
}

function submit() {
    if(correctAnswer.length == 0) {
        document.getElementById("display-area").innerText="シード値を入力して「はじめる」を押してください";
    } else if (endgame == true) {
        var p = document.createElement("p");
        p.innerText = "シード値を入力して「はじめる」を押してください";
        document.getElementById("display-area").appendChild(p);
    } else {
        attempt += 1;
        var input = document.getElementById("text-box").value;
        renderAnswer(input);
    }
}

function renderAnswer(input) {
    var textArea = document.getElementById("display-area");
    correctLetter = 0;
    textArea.appendChild(makeAnswerDisplayNodes(input));
    var br =document.createElement("br");
    textArea.appendChild(br);
    makeGojuon();
    if(correctLetter == 5) {
        var p = document.createElement("p");
        p.classList.add("correct");
        p.innerText = "正解！ 試行回数: " + attempt;
        textArea.appendChild(p);
        endgame = true;
    }
}

function makeGojuon() {
    var gojuonArea = document.getElementById("gojuon-area");
    var gojuonClone = gojuonArea.cloneNode( false );
    gojuonArea.parentNode.replaceChild( gojuonClone , gojuonArea );
    var gojuonArea = document.getElementById("gojuon-area");
    var gojuons = gojuon.split("");
    for(var i = 0; i < gojuons.length; i ++) {
        var div = document.createElement("span");
        if(submittedCharacters.includes(gojuons[i])) {
            if(correctAnswer.split("").includes(gojuons[i])) {
                div.classList.add("yellow");
            } else {
                div.classList.add("used");
            }
        } else {
            div.classList.add("not-used");
        }
        div.innerText = gojuons[i];
        gojuonArea.appendChild(div);
        if(i % 15 == 14) {
            var br =document.createElement("br");
            gojuonArea.appendChild(br);
        }
    }
};

function makeAnswerDisplayNodes(input) {
    var p = document.createElement("p");
    var inputs = input.split("");
    for(var i = 0; i < inputs.length; i ++) {
        submittedCharacters.push(inputs[i]);
        if (isHit(inputs[i], i)) {
            var div = document.createElement("span");
            div.classList.add("green");
            div.innerText = inputs[i];
            correctLetter += 1;
            p.append(div);
        } else if (isBlow(inputs[i])) {
            var div = document.createElement("span");
            div.classList.add("yellow");
            div.innerText = inputs[i];
            p.append(div);
        } else {
            var div = document.createElement("span");
            div.classList.add("gray");
            div.innerText = inputs[i];
            p.append(div);
        }
    }
    return p;
}

function isHit(character, i) {
    return correctAnswer.split("")[i] == character
}

function isBlow(character) {
    return correctAnswer.split("").includes(character);
}

function copyRecord() {
    var copyText = "WORDLEja \r\n" + "seed: " + seed + "\r\nline: " + attempt + "\r\n\r\n";
    for(var i = 0; i < submittedCharacters.length; i ++){
        if ((i - 1) % 5 == 4) {
            copyText += "\r\n";
        }
        if (isHit(submittedCharacters[i], i%5)) {
            copyText += "🟩";
        } else if (isBlow(submittedCharacters[i])) {
            copyText += "🟨";
        } else {
            copyText += "⬜";
        }
    }
    navigator.clipboard.writeText(copyText);
    document.getElementById("copy-record-description").innerText = "棋譜をコピーしました！";
}
function enterSubmit(){
    if( window.event.keyCode == 13 ){
      submit();
    }
}
function enterSeed(){
    if( window.event.keyCode == 13 ){
      seedSubmit();
    }
}